# ComboBoxMember Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ComboBoxMember Properties
ComboBoxMember Class See Also
---
The ComboBoxMember type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Enabled | Gets or sets a value indicating whether the item is enabled.  (Inherited from RibbonItem.) |
| GroupName | The group to which the ComboBoxMember is assigned. |
| Image | The image shown on the ComboBoxMember. |
| ItemText | Gets or sets the text displayed on the item.  (Inherited from RibbonItem.) |
| ItemType | Gets the item type. (Inherited from RibbonItem.) |
| LongDescription | Long description of the command tooltip  (Inherited from RibbonItem.) |
| Name | The name of the item. (Inherited from RibbonItem.) |
| ToolTip | The description that appears as a ToolTip for the item. (Inherited from RibbonItem.) |
| ToolTipImage | The image to show as a part of the button extended tooltip  (Inherited from RibbonItem.) |
| Visible | Gets or sets a value indicating whether the item is visible.  (Inherited from RibbonItem.) |

# See Also
ComboBoxMember Class
Autodesk.Revit.UI Namespace